{
  "catalog": [
    {
      "id": 1,
      "name": "ТВ и аудио",
      "description": "Телевизоры и аксессуары, аудиотехника",
      "children": [
        {
          "id": 2,
          "name": "Телевизоры",
          "description": "Smart TV, Android TV, 4K UHD",
          "children": [
            {
              "id": 3,
              "name": "Samsung UE50AU7100UXCE",
              "description": "Безрамочный дизайн с большим 50-дюймовым экраном",
              "text": "Телевизор LED Samsung UE50AU7100UXCE с безрамочным дизайном и большим 50-дюймовым экраном порадует 4K-разрешением. Качество изображения улучшено благодаря набору инновационных технологий от Samsung. Лишние шумы в цифровом сигнале устранены, а динамичность и яркость картинки предельно улучшены. Громкие динамики на 20 Вт с объемным звучанием превращают обычный ТВ в домашний кинотеатр.",
              "image": "https://c.dns-shop.ru/thumb/st4/fit/320/250/602f87107f40113009c7344b7ddbc443/1403e65eca4452ed9689f0876c6b890dd889a497d009f8035412e0cec009b850.jpg"
            },
            {
              "id": 4,
              "name": "LG 43UQ76003LD",
              "description": "Яркое и детализированное изображение",
              "text": "Каждое транслируемое на экран телевизора LED LG 43UQ76003LD изображение заиграет яркими красками, впечатляя пользователей поразительной детализацией, которая достигается высоким 4K UltraHD-разрешением. Вы не сможете оторвать взгляд от контента, ведь каждый кадр удивит непревзойденной реалистичностью, а ответственность за обработку контента возьмет на себя интеллектуальный процессор α5 Gen5.",
              "image": "https://c.dns-shop.ru/thumb/st1/fit/320/250/6d29f0ef4cfdb6d71136722e8d99fafe/414f6bd703edd1c2b694c64807924e98f729f5338a04b9725a5df621efdce450.jpg"
            }
          ]
        },
        {
          "id": 5,
          "name": "Аудиотехника",
          "description": "Колонки, аудиосистемы, домашняя акустика",
          "children": [
            {
              "id": 6,
              "name": "Аудиосистема LG XBOOM CK43",
              "description": "Высокий уровень качества звука",
              "text": "Соответствующая формату 2.0 домашняя аудиосистема LG CK43 порадует вас высоким уровнем качества звука, который, в частности, достигается за счет использования при производстве колонок, которыми укомплектована модель, высококачественного MDF. Мощность аудиосистемы составляет значительные 300 Вт. В качестве источников звука используются компакт-диски и USB-устройства (для установки последних используются два USB-порта). Поддерживаемые форматы файлов – AAC, MP3 и WMA. Предусмотрен и FM-радиоприемник, имеющий память на 50 радиостанций. Прием радиопередач ведется в диапазоне от 87.5 до 108 МГц.",
              "image": "https://c.dns-shop.ru/thumb/st4/fit/320/250/082f06339cc92bbccb7c4a460686febe/5fba575dec597f3cd99f83ffd41aebefc71932ee244d15bbf1ac8a8e3ca61f30.jpg"
            },
            {
              "id": 7,
              "name": "Аудиосистема JBL PARTYBOX 710",
              "description": "Насыщенное, чистое звучание",
              "text": "Домашняя аудиосистема JBL PARTYBOX 710 ‒ мощная колонка с насыщенным, чистым звучанием. Обладая мощностью 800 Вт, она обеспечивает профессиональное, сбалансированное звучание в диапазоне 35-20000 Гц с раскатистыми басами. Колонка оснащена светодиодной подсветкой, что делает доступным эффектное световое шоу в такт музыке. Благодаря функции «Караоке» можно разнообразить любую вечеринку.",
              "image": "https://c.dns-shop.ru/thumb/st4/fit/500/500/94319095b84c121e06fc0368ac4cb78b/11c1b5118660514cb6a0f72b2b51221d3552287416544ff585495cb1cc81463d.jpg"
            }
          ]
        }
      ]
    },
    {
      "id": 8,
      "name": "Смартфоны и фототехника",
      "description": "Смартфоны и гаджеты, планшеты, электронные книги, фототехника",
      "children": [
        {
          "id": 9,
          "name": "Смартфоны",
          "description": "Смартфоны Apple, Samsung. Аксессуары",
          "children": [
            {
              "id": 10,
              "name": "Смартфон Apple iPhone 15 128 ГБ",
              "description": "Встречайте смартфон Apple iPhone 15",
              "text": "Apple iPhone 15 не оставит вас в беде благодаря экстренному оповещению через спутник и функцию определения аварии. Помощь придет в самый нужный момент. Модель отличается стильным внешним видом. Непревзойденное сочетание цвета и долговечности: стекло и алюминий в едином дизайне. Корпус Apple iPhone 15 выполнен из 75% переработанного алюминия. Чип A16 Bionic демонстрирует невероятную мощь, признанную экспертами. Заряда устройства хватает на весь день для всего, что вам по душе. Смотрите видео до 20 часов. Для подзарядки аккумулятора воспользуйтесь разъемом USB Type-C. Основная камера 48 Мп с 2-кратным телеобъективом позволит делать снимки в высочайшем разрешении.",
              "image": "https://c.dns-shop.ru/thumb/st1/fit/500/500/41edbfdd1b4ef4a38f3ac15b85e02902/2258685cc32bbd96de406852bd9b2d94916029658cd6fa120a9f97a4bc0af297.jpg"
            },
            {
              "id": 11,
              "name": "Смартфон Samsung Galaxy A15 256 ГБ",
              "description": "Глубокий черный цвет и своевременная смена кадров",
              "text": "Смартфон Samsung Galaxy A15 обладает 6.5-дюймовым Super AMOLED-дисплеем, который отображает глубокий черный цвет и гарантирует своевременную смену кадров. Чувствительный датчик анализирует уровень внешнего освещения и корректирует яркость. Энергия аккумулятора емкостью 5000 мАч рассчитана на 109-часовое прослушивание треков. Хранение файлов производится во встроенной памяти объемом 256 ГБ. Смартфон Samsung Galaxy A15 верифицирует личность пользователя по отпечатку и чертам лица. Основная камера с 3 модулями поддерживает функцию автофокуса, настраивающую резкость кадра. Вычислительная мощность состоит из 8-ядерного процессора и 8 ГБ оперативной памяти. Пользователи могут запускать ресурсоемкие приложения и серфить между окнами без задержек.",
              "image": "https://c.dns-shop.ru/thumb/st1/fit/500/500/dfbb9dd86c59e4681fb6301b4017dc0c/4b49c88689942bc63d8f12d99b37c0eba499bb7d79ec9c020566bfcd40a37aab.jpg"
            }
          ]
        },
        {
          "id": 12,
          "name": "Фототехника",
          "description": "Зеркальные фотоаппараты, аксессуары",
          "children": [
            {
              "id": 13,
              "name": "Зеркальный фотоаппарат Canon EOS 250D Kit 18-55mm IS STM",
              "description": "Запись видео в 4К и съемка объектов в динамике",
              "text": "Зеркальный фотоаппарат Canon EOS 250D Kit 18-55mm IS STM представлена в черном корпусе из прочного пластика. Это легкая камера с сенсорным поворотным экраном, которая поддерживает запись видео в 4К и съемку объектов в динамике. Благодаря крупному сенсору, быстрому чипу и точному автофокусу вы получаете идеальный результат при съемке в любых условиях. Модель содержит встроенную вспышку и фильтр для устранения эффекта красных глаз. Canon EOS 250D Kit 18-55mm IS STM использует модули Bluetooth и Wi-Fi для более легкой отправки видео и изображений на планшеты и смартфоны. Для этого на них должно быть установлено приложение Canon Camera Connect. В основе камеры ‒ CMOS-матрица с поддержкой 24.1 Мп и функцией очистки, а также процессор DIGIC 8. Такое разрешение матрицы позволяет создавать макроснимки мелких объектов при доступном кадрировании.",
              "image": "https://c.dns-shop.ru/thumb/st1/fit/500/500/d8ac799c44e2ade160482bd5bac40b17/42b08bc250a403778e03943b526e871eaf8896b823ae2e1be0df8d8ea3669029.jpg"
            },
            {
              "id": 14,
              "name": "Зеркальный фотоаппарат Pentax K-3 Mark III Body",
              "description": "Высокоскоростная серийная съемка",
              "text": "Зеркальная камера Pentax K-3 Mark III Body с матрицей CMOS размером 23.3x15.5 мм обеспечивает высокоскоростную серийную съемку в режиме 12 кадр./сек. Она позволяет снимать видео в 4K, делая каждый кадр четким. Аппарат содержит оптический видоискатель, особенность которого в покрытии 100% и поддержке увеличения 1.05x. Расположение окуляра выше экрана не позволяет фотографу касаться дисплея носом во время слежения за объектом. Pentax K-3 Mark III Body с сенсором BSI. расположенным под видоискателем, поддерживает 26.78 Мп при уровне чувствительности ISO 100-1600000. Он отключает подсветку дисплея автоматически, когда вы приближаете ее к глазу. Благодаря этому вы сможете комфортно построить композицию. Для построения изображений высокого разрешения применяется функция «Pixel Shift».",
              "image": "https://c.dns-shop.ru/thumb/st4/fit/500/500/dbdb02165e6981180462f61c5c6bfc17/f793144cd58ec08e4fd1c56c0f7cdb34ec03b25d5adf111688c343f93e107d3d.jpg"
            }
          ]
        }
      ]
    },
    {
      "id": 15,
      "name": "ПК и ноутбуки",
      "description": "Ноутбуки и аксессуары, компьютеры и ПО, периферия и аксессуары",
      "children": [
        {
          "id": 16,
          "name": "ПК",
          "description": "Персональные компьютеры и периферия",
          "children": [
            {
              "id": 17,
              "name": "ПК ARDOR GAMING RAGE H335",
              "description": "Высокая мощность и производительность",
              "text": "ПК ARDOR GAMING RAGE H335 – системный блок в черном корпусе Mid-Tower с прозрачным окном на боковой стенке, которое позволит оценить внешний вид сборки. Модель поставляется без предустановленной операционной системы, благодаря чему вы сможете самостоятельно установить на компьютер привычную ОС и нужное программное обеспечение. Сборка функционирует на базе 10-ядерного процессора Intel Core i5-13400F. Чипсет имеет 6 производительных ядер, которые вместе с 16 ГБ оперативной памяти обеспечивают бесперебойную работу компьютера при запуске ресурсоемких игр и в многозадачном режиме.",
              "image": "https://c.dns-shop.ru/thumb/st4/fit/500/500/55eb814a23234819d67dfe8be48c0839/fc30681755498431587b5317c6ae0062eb5dde16dd738dd80bffeaec38e66c4a.jpg"
            },
            {
              "id": 18,
              "name": "ПК MSI MAG Infinite S3 13NUC5-1054XRU",
              "description": "Стабильность в многозадачном режиме",
              "text": "ПК MSI MAG Infinite S3 13NUC5-1054XRU функционирует на базе 10 ядерного процессора Intel Core i5-13400F, который обрабатывает до 16 вычислительных потоков информации для стабильной работы и развлечений в многозадачном режиме. Производительность видеокарты NVIDIA GeForce RTX 4060 и архитектура Ada позволит пользователю оценить весь потенциал трассировки лучей и насладиться детализированным виртуальным миром с реалистично смоделированным поведением света. ПК MSI MAG Infinite S3 13NUC5-1054XRU облачен в корпус с большими воздухозаборными отверстиями для легкого притока воздуха к внутренним компонентам. Оперативная память DDR5-типа имеет объем 16 ГБ для быстродействия системы при запуске требовательных игр и программ. ",
              "image": "https://c.dns-shop.ru/thumb/st1/fit/500/500/ed7b1afa0fd048d3faf5e1d6ecc4cbe0/698d7a46185be432a99b6ce1aea3bf66c00aa2cb3652972fe66041634dab07f1.jpg"
            }
          ]
        },
        {
          "id": 19,
          "name": "Ноутбуки",
          "description": "Ноутбуки и аксессуары",
          "children": [
            {
              "id": 20,
              "name": "Ноутбук ASUS Vivobook Go 15 E1504FA-BQ533",
              "description": "Тонкий ноутбук для работы и развлечений",
              "text": "Ноутбук ASUS Vivobook Go 15 E1504FA-BQ533 выполнен в тонком корпусе черного цвета с диагональю экрана 15.6 дюймов. Его дисплей раскрывается на 180 градусов, что делает устройство удобным для просмотра видео большой компанией. IPS-экран демонстрирует четкую картинку, не искажая цвета, благодаря широким углам обзора. Разрешение Full-HD (1920x1080) позволяет комфортно смотреть видео в Интернете в любых форматах. На ASUS Vivobook Go 15 E1504FA-BQ533 не установлена ОС, что дает возможность подобрать удобную систему для работы или развлечений. Производительность аппарата обеспечивает процессор AMD Ryzen 5 7520U с 4-ядерной архитектурой. LPDDR5-память объемом 16 ГБ позволяет быстро работать, с легкостью запускать несколько приложений, не ощущая торможения и зависания системы. Надежной платформой для хранения цифровой информации служит SSD-накопитель объемом 512 ГБ. С ним аппарат быстро загружает фото и видео, легко запускает приложения.",
              "image": "https://c.dns-shop.ru/thumb/st1/fit/500/500/771faba85b5ccceb0f58d840975a0337/e56f301b55c89ee1983769303023bd19a458a0b31f81719ac3f48eebcea1d4b2.jpg"
            },
            {
              "id": 21,
              "name": "Ноутбук HUAWEI MateBook D 16 2024 MCLF-X",
              "description": "Удобен для работы с графикой",
              "text": "Ноутбук HUAWEI MateBook D 16 2024 MCLF-X диагональю 16 дюймов идет без ОС. Это позволяет подобрать систему, удобную для офисной работы или игр. В основе экрана лежит IPS-матрица с разрешением 1920x1200. Он точно передает цвета и уменьшает нагрузку на зрение благодаря технологиям DC-затемнения и защиты от синего свечения. Это делает устройство удобным для работы с графикой, веб-серфинга, просмотра видео. Видеочип Intel UHD Graphics без задержки обрабатывает графику и выводит ее на дисплей. Он ускоряет воспроизведение видео онлайн. За производительность HUAWEI MateBook D 16 2024 MCLF-X отвечает процессор Intel Core i5-12450H с 4 энергоэффективными и 4 производительными ядрами. Он поддерживает 12 потоков и рассчитан на решение профессиональных задач, подходит для поддержки ПО и редактирования видео. LPDDR4x-память объемом 16 ГБ отличается меньшим энергопотреблением. Это повышает быстродействие аппарата за счет разгрузки системы охлаждения. Благодаря SSD-диску объемом 512 ГБ не нужно долго ждать загрузки файлов.",
              "image": "https://c.dns-shop.ru/thumb/st1/fit/500/500/a836a0f8fb5bfb713889fd3b815e5ebc/f8c1d514292bd887b7279a1fa5f26692c8c70e6dd1ca86b6a8a7b3a4f4b6b0bd.jpg"
            }
          ]
        }
      ]
    }
  ]
}
